Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
        waitForFinishQueue=true;
        fastQueueMode=true;
        app_cmd(APP_PRE_SETVLVSENSOR,String(i)+ARG_DELIMITER+s1+ARG_DELIMITER+s2);
        fastQueueMode=true;
    }
    fastQueueMode=true;
}

void CStmApp::setLearnAfterMovements()
{
    waitForFinishQueue=true;
    app_cmd(APP_PRE_SETLEARNMOVEM,String(learnAfterMovements));
    fastQueueMode=true;   
}

void CStmApp::setMotorChars()
{
    waitForFinishQueue=true;
    app_cmd(APP_PRE_SETMOTCHARS,String(motorChars.maxLowCurrent)+ARG_DELIMITER+String(motorChars.maxHighCurrent));   
    fastQueueMode=true;
}

void  CStmApp::app_loop() 
{
    app_check_data();
    appHandler();
}

bool CStmApp::checkCmdIsAvailable (String thisCmd)
{   
    uint8_t i=0;
    while (commCmds[i] != NULL) {
        if (memcmp((const char*) &thisCmd,commCmds[i],5)==0) {
            return(true);
        }
        i++;
    }
    UART_DBG.println("Command not found "+String(thisCmd));
    return (false);
}

void  CStmApp::app_cmd(String command,String args) 
{    
    if (checkCmdIsAvailable(command)) {
        String s=command+ARG_DELIMITER;
        if (args!="") s+=args+ARG_DELIMITER;
        UART_DBG.println("push "+s);
        Queue.push(s);
    }
}

int8_t CStmApp::findTempID(char* ID) 
{
    for (uint8_t i=0;i<TEMP_SENSORS_COUNT;i++) {
        if (strncmp(ID,VdmConfig.configFlash.tempsConfig.tempConfig[i].ID,sizeof(VdmConfig.configFlash.tempsConfig.tempConfig[i].ID))==0) {
           return (i);
        }
    }
    return -1;
}

void CStmApp::setSensorIndex(uint8_t valveIndex,char* sensor1,char* sensor2)
{
    int8_t sensorIdx;
    sensorIdx=findTempID(sensor1);
    if (sensorIdx>=0) actuators[valveIndex].tIdx1=sensorIdx+1; else actuators[valveIndex].tIdx1=0;
    sensorIdx=findTempID(sensor2);
    if (sensorIdx>=0) actuators[valveIndex].tIdx2=sensorIdx+1; else actuators[valveIndex].tIdx2=0;
}

void  CStmApp::app_check_data() 
{
    int availcnt;

    availcnt = UART_STM32.available();
   
    if (availcnt > 0) {

        for (int c = 0; c < availcnt; c++)
        {           
            *bufptr++ = (char) UART_STM32.read();
            buflen++;
        }
        if (buflen>=sizeof(buffer)-1) {
            *bufptr='\r';
        }        
    }

    // if there is a little in the buffer
    if(buflen >= 5) 
    {
        for (unsigned int c = 0; c < buflen; c++)
        {     
            if (buffer[c] == '\r') {
                buffer[c] = '\0';
                found = true;
                buflen = 0;         // reset counter
                bufptr = buffer;    // reset ptr    
                UART_STM32.read();  // read possible \n
                syslog.log(LOG_DEBUG, "found new data packet: >" + String(buffer) + "<");
            }
        }
    }
   

//    if (found) {
    if(!found) 
    {
        //syslog.log(LOG_DEBUG, "incomplete buffer : >" + String(buffer) + "<");
    }
    else 
    {
        found = false;

        if (stmStatus==STM_NOT_READY) stmStatus=STM_READY;
        // devide buffer into command and data
		// ****************************************
		cmdptr = buffer;
        
		for(int x=0;x<7;x++) {
			cmdptrend = strchr(cmdptr,' ');
			if (cmdptrend!=NULL) {
				*cmdptrend = '\0';
				if(x==0) 		strncpy(cmd,cmdptr,sizeof(cmd)-1);		// command
				else if(x==1) { 
                    memset (arg0,0x0,sizeof(arg0));
                    strncpy(arg0,cmdptr,sizeof(arg0)-1); 
                    argcnt=1;	
                } 	// 1st argument
				else if(x==2) {	
                    memset (arg1,0x0,sizeof(arg1));
                    strncpy(arg1,cmdptr,sizeof(arg1)-1); 
                    argcnt=2;	
                } 	// 2nd argument
                else if(x==3) {	
                    memset (arg2,0x0,sizeof(arg2));
                    strncpy(arg2,cmdptr,sizeof(arg2)-1); 
                    argcnt=3;	
                } 	// 3rd argument
                else if(x==4) {
                    memset (arg3,0x0,sizeof(arg3));	
                    strncpy(arg3,cmdptr,sizeof(arg3)-1); 
                    argcnt=4;	
                } 	// 4th argument
                else if(x==5) {	
                    memset (arg4,0x0,sizeof(arg4));
                    strncpy(arg4,cmdptr,sizeof(arg4)-1); 
                    argcnt=5;	
                } 	// 5th argument

                else if(x==6) {	
                    memset (arg5,0x0,sizeof(arg5));
                    strncpy(arg5,cmdptr,sizeof(arg5)-1); 
                    argcnt=6;	
                } 	// 6th argument
				cmdptr = cmdptrend + 1;
			}
		}
 
		// get actual values
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		if(memcmp(APP_PRE_GETACTUALPOS,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"actual position answer "+String(arg0ptr)+" : "+String(arg1ptr));
                }
                actuators[atoi(arg0ptr)].actual_position = atoi(arg1ptr);
            }
            appState=APP_IDLE;
        }

        // get mean current 
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETMEANCURR,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"mean current answer "+String(arg0ptr)+" : "+String(arg1ptr));  
                }
                actuators[atoi(arg0ptr)].meancurrent = atoi(arg1ptr);
            }
            appState=APP_IDLE;
        }
    
        // get valve status
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETVLSTATUS,cmd,5) == 0) { 
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"valve status "+String(arg1ptr));
                }
                uint8_t nActuators = atoi(arg0ptr);
                char* cmdptr;
                char* ps=arg1ptr;
                for (uint8_t idx=0; idx<nActuators;idx++) {
                    if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                    actuators[idx].state = atoi(ps);
                    if (cmdptr!=NULL) ps=cmdptr+1;
                    idx++;
                }  
                stmStatus=STM_READ_ALL_FROM_QUEUE;    
            }
            appState=APP_IDLE;
        }

        // get set target answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_SETTARGETPOS,cmd,5) == 0) {
            if(argcnt == 0) {
                settarget_check = true; 
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }
        // get target position
            // ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            else if(memcmp(APP_PRE_GETTARGETPOS,cmd,5) == 0) {
                if(argcnt == 2) {
                    actuators[atoi(arg0ptr)].target_position = atoi(arg1ptr);
                }
                appState=APP_IDLE;
            }

        // get data values
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETVLVDATA,cmd,5) == 0) {
            if(argcnt == 6) {
                uint8_t idx=atoi(arg0ptr);
                if(idx < ACTUATOR_COUNT) {
                    actuators[idx].actual_position = atoi(arg1ptr);
                    actuators[idx].meancurrent = atoi(arg2ptr);
                    actuators[idx].state = atoi(arg3ptr);
                    actuators[idx].temp1 = ConvertCF(atoi(arg4ptr))+getTOffset(actuators[idx].tIdx1);
                    actuators[idx].temp2 =  ConvertCF(atoi(arg5ptr))+getTOffset(actuators[idx].tIdx2);

