Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG, "got valve data #"+String(arg0ptr)+" pos:"+String(arg1ptr)+
                        " mean:"+String(arg2ptr)+" state:"+String(arg3ptr)+" t1:"+String(arg4ptr)+" t2:"+String(arg5ptr));
                    }
                }
            } 
            appState=APP_IDLE;
        }

        // get onewire data answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        
        else if(memcmp(APP_PRE_GETONEWIRECNT,cmd,5) == 0) {
            if(argcnt == 1) {
                tempsPrivCount= atoi(arg0ptr); 
                if (tempsPrivCount!=tempsCount) app_cmd(APP_PRE_GETONEWIRECNT,String(255));
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"one wire count "+String(tempsPrivCount));
                }       
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"one wire data "+String(arg1ptr));
                } 
                tempsPrivCount= atoi(arg0ptr);
                if (tempsPrivCount>0) {
                    char* cmdptr;
                    char* ps=arg1ptr;
                    for (uint8_t idx=0; idx<tempsPrivCount;idx++) {
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(tempsId[idx].id,ps,sizeof(tempsId[idx].id));
                        ps=cmdptr+1;
                        idx++;
                    }
                }
                tempsCount=tempsPrivCount;
            }
            appState=APP_IDLE;
        }

		else if(memcmp(APP_PRE_GETONEWIREDATA,cmd,5) == 0) {
            syslog.log(LOG_DEBUG,"one wire data "+String(argcnt)+" "+String(arg0ptr)+":"+String(arg1ptr));
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"one wire data "+String(arg0ptr)+":"+String(arg1ptr));
                } 
                strncpy(tempsId[tempIndex].id,arg0ptr,sizeof(tempsId[tempIndex].id));

                int8_t idx=findTempID(arg0ptr);
                if (idx>=0) {
                    memset(temps[idx].id,0x0,sizeof(temps[idx].id)); 
                    strncpy(temps[idx].id,arg0ptr,sizeof(temps[idx].id));
                    int16_t cValue=atoi(arg1ptr);
                    temps[idx].temperature=ConvertCF(cValue)+VdmConfig.configFlash.tempsConfig.tempConfig[idx].offset;
                } 
                tempIndex++;
                if (tempIndex>=tempsCount) {  // all temp sensors read
                    tempIndex=0;
                }
            }
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETVERSION,cmd,5) == 0) {
            if(argcnt > 0) {
                VdmSystem.stmVersion=arg0ptr; 
                VdmSystem.stmBuild=0;
            }
            if(argcnt > 1) {
                 VdmSystem.stmBuild=atoi(arg1ptr);
            }
            if (memcmp(cmd,(const void*) &cmd_buffer,5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETONEWIRESETT,cmd,5) == 0) {
            if(argcnt == 3) {
                setSensorIndex(atoi(arg0ptr),arg1ptr,arg2ptr);
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"one wire settings data "+String(arg0ptr)+" : "+String(arg1ptr));
                }   
                uint8_t nItems= atoi(arg0ptr);
                if (nItems>0) {
                    char* cmdptr;
                    char* ps=arg1ptr;
                    for (uint8_t idx=0; idx<nItems;idx++) {
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(arg4ptr,ps,sizeof(arg4));
                        if (cmdptr!=NULL) ps=cmdptr+1;
                        if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                        strncpy(arg5ptr,ps,sizeof(arg5));
                        setSensorIndex(idx,arg4ptr,arg5ptr);
                        if (cmdptr!=NULL) ps=cmdptr+1;
                    }
                }
                
            }
            appState=APP_IDLE;
        }
        
        else if(memcmp(APP_PRE_SETONEWIRESEARCH,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETLEARNMOVEM,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETLEARNMOVEM,cmd,5) == 0) {
            if(argcnt == 1) {
                learnAfterMovements=atoi(arg0ptr);
            }
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETVLVSENSOR,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETALLVLVOPEN,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETVLLEARN,cmd,5) == 0) {
            appState=APP_IDLE;
        }
        
        else if(memcmp(APP_PRE_SETDETECTVLV,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_SETMOTCHARS,cmd,5) == 0) {
            appState=APP_IDLE;
        }

        else if(memcmp(APP_PRE_GETMOTCHARS,cmd,5) == 0) {
            if(argcnt == 2) {
                motorChars.maxLowCurrent=atoi(arg0ptr);
                motorChars.maxHighCurrent=atoi(arg1ptr);
            }
            appState=APP_IDLE;
        }

        // very important to reset to idle if no valid command was found
        else {
            syslog.log(LOG_DEBUG, "unknown command: >" + String(cmd) + "<");
            appState=APP_IDLE;
        }

        cmd_buffer="";
        buffer[0] = '\0';
    }
}


void CStmApp::appHandler()
{
    switch (appState) {
        case APP_IDLE: 
            appRetry=0;   
            app_comm_machine();
            break;
        
        case APP_PENDING: 
            appRetry ++;
            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {		
                syslog.log(LOG_DEBUG,"App retries "+String(appRetry)+String(":")+String(commstate));
            }
            if (appRetry>maxAppRetries) {
                appState=APP_TIMEOUT;
                appRetry=0;
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {		
                    syslog.log(LOG_DEBUG,"Max app retries reached, set app to timeout");
                }
            }
            break;
        
        case APP_TIMEOUT:
            appTimeOuts++;
            if (appTimeOuts>maxAppTimeOuts) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {		
                    syslog.log(LOG_DEBUG,"Max app timeouts reached, reset STM");
                } 
                appTimeOuts=0; 
                Stm32.ResetSTM32(true); 
                appState=APP_IDLE; 
            } else {
                commstate = COMM_GETDATA;
                app_comm_machine();   
            } 
            break;
        
        default:    
            appState=APP_IDLE;
            break;
    }
}


void  CStmApp::app_comm_machine()
{
    char sendbuffer[30];
    char valbuffer[10];

    switch(commstate) {

        case COMM_IDLE: 
                appState=APP_IDLE;
                if (checkNewTarget()) {
                    commstate = COMM_SENDTARGET;
                } else {
                    commstate = COMM_GETDATA;
                }
                break;

        // send target position values
        case COMM_SENDTARGET:
                commstate = COMM_GETDATA;
                
                for (uint8_t x=0; x<ACTUATOR_COUNT; x++) {
                    if (VdmConfig.configFlash.valvesConfig.valveConfig[x].active) {
                        // check if target has changed
                        if(target_position_mirror[x] != actuators[x].target_position)
                        {
                            if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                                syslog.log(LOG_DEBUG, "valve position has changed : "+String(x)+" = "+String(actuators[x].target_position));
                            }
                            settarget_check=false;
                            memset(sendbuffer,0x0,sizeof(sendbuffer));
                            strcat(sendbuffer, APP_PRE_SETTARGETPOS);
                            strcat(sendbuffer, " ");

