Lenti84/VdMot_Controller/software_esp32/src/stmApp.cpp
                            itoa(x, valbuffer, 10);
                            strcat(sendbuffer, valbuffer);
                            strcat(sendbuffer, " ");   

                            itoa(actuators[x].target_position, valbuffer, 10);      
                            strcat(sendbuffer, valbuffer);
                            strcat(sendbuffer, " ");

                            UART_STM32.println(sendbuffer);
                            UART_DBG.println("valve position has changed : "+String(x)+" = "+String(actuators[x].target_position));
                            // break loop, next valve will be served in next cycle
                            appState=APP_PENDING;
                            break;

                            timeout = 10;
                            //commstate = COMM_CHECKTARGET;
                        }   
                    }
                }
                // update target position mirror - 
                for (uint8_t x = 0; x<ACTUATOR_COUNT; x++) {
                    if (VdmConfig.configFlash.valvesConfig.valveConfig[x].active) {
                        target_position_mirror[x] = actuators[x].target_position;
                    }
                }
                
                break;

        // check correct transmission of target value
        case COMM_CHECKTARGET:
                if (timeout>0) timeout--;
                else {
                    // answer received
                    if (settarget_check) {                        
                        commstate = COMM_GETDATA; 
                    }
                    else {
                        if (retry>0) retry--;
                        else commstate = COMM_GETDATA; 
                        commstate = COMM_SENDTARGET;
                    }
                }
                
                break;

        case COMM_GETDATA:  
                commstate =  COMM_GETONEWIRECOUNT;
                
                // walk through all valves, one per cycle
                if (getindex<ACTUATOR_COUNT-1) getindex++; else getindex=0;

                memset(sendbuffer,0x0,sizeof(sendbuffer));
                strcat(sendbuffer, APP_PRE_GETVLVDATA);
                strcat(sendbuffer, " ");

                itoa(getindex, valbuffer, 10);
                strcat(sendbuffer, valbuffer);
                strcat(sendbuffer, " ");   

                UART_STM32.println(sendbuffer);
                
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG, sendbuffer);
                }
                appState=APP_PENDING;
                break;

        case COMM_GETONEWIRECOUNT:
                if (tempsPrivCount>0) {
                    commstate = COMM_GETONEWIRE;
                } else {
                    commstate =  COMM_HANDLEQUEUE;   
                }
                if (checkTempsCount==0) {
                    memset(sendbuffer,0x0,sizeof(sendbuffer));
                    
                    strcat(sendbuffer, APP_PRE_GETONEWIRECNT);
                    strcat(sendbuffer, " ");
                    UART_STM32.println(sendbuffer);
                    checkTempsCount=20;
                    appState=APP_PENDING;

                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG,"get one wire count");
                    } 
                }    
                checkTempsCount--;
                break;

        case COMM_GETONEWIRE:
                commstate = COMM_HANDLEQUEUE;
                if (tempsPrivCount>0) {
                    memset(sendbuffer,0x0,sizeof(sendbuffer));
                    
                    strcat(sendbuffer, APP_PRE_GETONEWIREDATA);
                    strcat(sendbuffer, " ");

                    itoa(tempIndex, valbuffer, 10);
                    strcat(sendbuffer, valbuffer);
                    strcat(sendbuffer, " ");   

                    UART_STM32.println(sendbuffer);
                    appState=APP_PENDING;

                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG,"get one wire data: " + String(sendbuffer));
                    } 
                }
                break;

        case COMM_HANDLEQUEUE:
                if ((cmd_buffer=="") && (Queue.available()>0) && (stmStatus>=STM_READY)) {
                    memset(&cmd_buffer,0x0,sizeof(cmd_buffer));
                    cmd_buffer=Queue.pop();
                    UART_DBG.println("pop "+String(cmd_buffer));
                    UART_STM32.println(cmd_buffer);
                    appState=APP_PENDING;
                }
                if (fastQueueMode) {
                    if (Queue.available()==0) {
                        fastQueueMode=false;
                        commstate = COMM_IDLE;
                    }
                } else commstate =COMM_IDLE;
                
                break;
        
        default:    
                commstate = COMM_IDLE;
                break;
    }
}
